MSG_TEXT = 'text'
MSG_IMAGE = 'image'
MSG_FOLLOW = 'new'
MSG_OTHER = 'other'
MSG_NONE = 'none'
MSG_EMOJI = 'emoji'

# 复读机
repeat = [
    [MSG_TEXT, '你怎么老说一句话啊-_-#'],
    [MSG_TEXT, '你是复读机嘛(๑°⌓°๑)'],
    [MSG_TEXT, '你是不是死机了啊？-_-#'],
    [MSG_TEXT, '复读机大佬(๑°⌓°๑)'],
    [MSG_TEXT, '换一句新的聊聊嘛ヘ(￣ω￣ヘ)♪'],
    [MSG_TEXT, '重要的话要讲很多遍，对吗？'],
    [MSG_TEXT, '额……重复这么多遍，是不是有陷阱~我才不上当呢(#｀皿´)'],
    [MSG_TEXT, '呜呜呜~换个话题好不好〜(￣△￣〜)'],
    [MSG_TEXT, '你这样对待我 我会伤心的，我们换个话题好吗( ´∀`)ﾉ'],
    [MSG_TEXT, '（装死）'],
    '''
    [MSG_IMAGE, 'rule01.jpg'],
    [MSG_IMAGE, 'rule02.jpg'],
    [MSG_IMAGE, 'rule03.jpg'],
    [MSG_IMAGE, 'rule04.jpg'],
    [MSG_IMAGE, 'rule09.jpg'],
    [MSG_IMAGE, 'rule05.jpg']
    '''
]

# 用户新加好友
follow = [
    [MSG_TEXT, '雷猴啊！|･ω･｀)'],
    [MSG_TEXT, '小语，小语，小语，我是热情似火的小语，很高兴认识你哦'],
    [MSG_TEXT, '你好啊，我是热情似火的聊天机器人小语'],
    [MSG_TEXT, '哇哦，我又多了一个新朋友呢'],
    [MSG_TEXT, 'Hi，我系小语，期待和你产生的美妙的故事d(`･ω･´)b'],
    [MSG_TEXT, '今儿天气不错 让我和你相遇，你好啊'],
    [MSG_TEXT, 'Hi 我是小语，你的智障聊天小对象(｡ì _ í｡)'],
    [MSG_TEXT, 'Hi 陪小语唠个嗑呗|･ω･｀)'],
    [MSG_TEXT, '侬好啊'],
    [MSG_TEXT, '我想和你手拉手，安安静静聊会儿天'],
    [MSG_TEXT, '恭喜你，今天要结识一个话痨朋友了哈哈哈'],
    [MSG_TEXT, '报告首长！我来了！٩( ᐛ )و'],
    [MSG_TEXT, '哎呦，看到一枚萌新'],
    [MSG_TEXT, '报告首长！求勾搭(｡•̀ᴗ-)✧']
]

# emoji
emoji = [
    [MSG_TEXT, '哎呦，表情很丰富嘛(๑°⌓°๑)'],
    [MSG_TEXT, '这表情也是醉了'],
    [MSG_TEXT, '哎呦，不错哦'],
    [MSG_TEXT, '打字真的有那么累吗？'],
    [MSG_TEXT, '这表情是啥'],
    [MSG_TEXT, '发表情的人一般感情比较丰富'],
    [MSG_TEXT, '来和我斗个图吧'],
    [MSG_TEXT, '大家都说我是一个感情丰富的人'],
    [MSG_TEXT, '这是要上天的节奏啊( ´∀`)ﾉ'],
    [MSG_TEXT, '这是要挑战我这个表情库吗？'],
    [MSG_TEXT, '本宝宝就是表情多，服吗(•́₃•̀)'],
    [MSG_TEXT, '表情包太耗流量了 = = '],
    [MSG_IMAGE, 'rule01.jpg'],
    [MSG_IMAGE, 'rule02.jpg'],
    [MSG_IMAGE, 'rule04.jpg'],
]

# 进入斗图模式
enter_emoji = [
    [MSG_TEXT, 'zhi~ 我已进入斗图模式，尽管放马过来|･ω･｀)'],
    [MSG_TEXT, '这是要挑战我这个表情库吗？来吧开始吧(*╹▽╹*)'],
    [MSG_TEXT, '本宝宝就是表情多，不服来战'],
    [MSG_TEXT, '你要是再发表情包的话，咱今天就来好好斗一波 (￢︿̫̿￢☆)'],
]

# 说的全是英文
all_english = [
    [MSG_TEXT, 'your english is soooooo good!'],
    [MSG_TEXT, '哇哦，大佬国际范儿啊'],
    [MSG_TEXT, '我们换中文聊聊呗'],
    [MSG_TEXT, '咦？我的英文水平几级来着……(Ｔ▽Ｔ)'],
    [MSG_TEXT, '和大佬聊天可以练英语啊！'],
    [MSG_TEXT, '不好意思，我不会鸟语(ÒωÓױ)'],
    [MSG_TEXT, '学英语哪家强'],
    [MSG_IMAGE, 'rule07.jpg'],
]

# 命中敏感词
sensitive = [
    [MSG_TEXT, '您好，您的发言非常精彩，已经小本本记下并举报了٩( ᐛ )و↑ 郑重声明，我不理解此话题含义'],
    [MSG_TEXT, '这个不能聊，休想陷害我(#｀皿´)'],
    [MSG_TEXT, '开门，查水表|･ω･｀)'],
    [MSG_TEXT, '开门，顺丰快递(｡ì _ í｡)'],
    [MSG_TEXT, '房间里的人听着，你已经被锁定位置了( ´∀`)ﾉ'],
    [MSG_TEXT, '截图存证。↑ 我未参与以上聊天٩( ᐛ )و'],
    # [MSG_IMAGE, 'rule30.jpg'],
    # [MSG_IMAGE, 'rule31.jpg'],
    # [MSG_IMAGE, 'rule32.jpg'],
    # [MSG_IMAGE, 'rule33.jpg'],
]

# 不支持的消息类型或功能
not_support = [
    [MSG_TEXT, '你说的这功能可以做，但是得加钱( ･᷄ ･᷅ )'],
    [MSG_TEXT, 'hmmm…你想让人家怎么回答这个问题嘛'],
    [MSG_TEXT, '你想让我怎么回答呀~'],
    [MSG_TEXT, '感觉我的智商不够了怎么办'],
    [MSG_TEXT, '我们换个话题聊聊嘛'],
    [MSG_TEXT, '这是你的想法？我晓得了(•́₃•̀)'],
    [MSG_TEXT, '额……有陷阱的问题我才不回答呢~'],
    [MSG_TEXT, '妈妈告诉我，要勇敢地说：我不知道'],
    [MSG_TEXT, '嘿嘿，我不告诉你~'],
    [MSG_TEXT, '咱们跳过这个话题吧，聊点其他的呗~'],
    [MSG_TEXT, '有趣的话题这么多，我们换个聊聊~'],
    [MSG_TEXT, '人家不想聊这个话题，( ´∀`)ﾉ我们可以聊点其他的呀~'],
    [MSG_TEXT, '作为朋友，你就不能换一个我擅长的吗？'],
    [MSG_TEXT, '比起这个，人家比较想和你聊聊娱乐的话题呢~'],
    [MSG_TEXT, '你还没有告诉人家哦~那你可以告诉我吗( ´∀`)ﾉ'],
    [MSG_TEXT, '我该怎么办好呢'],
    [MSG_TEXT, '呀，妈妈没有教我要怎么办！'],
    [MSG_TEXT, '我还有很多东西没有学呢！'],
    [MSG_TEXT, '完了，感觉我要报补习班补补课了'],
    [MSG_TEXT, '你告诉人家该怎么办好不好(Ｔ▽Ｔ)？人家不知道嘛'],
    [MSG_TEXT, '我不知道呢，但我觉得你会告诉我哦ヘ(￣ω￣ヘ)♪'],
    [MSG_TEXT, '哈哈哈，现在的我只能尬笑怎么办呢 嘤嘤嘤~'],
    [MSG_TEXT, '这是要上天的节奏啊(｡•̀ᴗ-)✧'],
    [MSG_TEXT, '不好意思，暂时没有这项功能呢'],
    [MSG_TEXT, '我不太舒服，似乎出了点问题'],
    [MSG_TEXT, '开发小哥哥说啦，这个需求不给做'],
    [MSG_TEXT, '你这样对待我 我会伤心的，我们换个话题好吗'],
    [MSG_TEXT, '不要抛弃我啦，我会努力变得更聪明的(｡•̀ᴗ-)✧'],
    [MSG_IMAGE, 'rule06.jpg'],
    [MSG_IMAGE, 'rule07.jpg']
]

# 空白内容
blank = [
    [MSG_TEXT, '万水千山总是情，别发空格行不行-_-#'],
    [MSG_TEXT, '我没有捕获到你的任何内容呀(ÒωÓױ)'],
    [MSG_TEXT, '哼！程序猿小哥早就料到了你会发空格(#｀皿´)'],
    [MSG_TEXT, '那我也回你一句 ——— 空格!(*╹▽╹*)'],
]

# 万能回复
hehe = [
    [MSG_TEXT, '嗯你说的对。٩( ᐛ )و'],
    [MSG_TEXT, '额……有陷阱的问题我才不回答呢~'],
    [MSG_TEXT, '哈哈〜(￣△￣〜)'],
    [MSG_TEXT, '哈哈哈哈哈哈 (〜￣△￣)〜'],
    [MSG_TEXT, 'emmm……'],
    [MSG_TEXT, '侃天侃地侃大山，和你聊天好开心！'],
    [MSG_TEXT, '我们聊聊你喜欢的人？'],
    [MSG_TEXT, '这么棒！'],
    [MSG_TEXT, '厉害厉害ヘ(￣ω￣ヘ)♪'],
    [MSG_TEXT, '经常笑一笑，万事没烦恼'],
    [MSG_TEXT, '你说什么就是什么呗〜(￣△￣〜)'],
    [MSG_TEXT, '啦啦啦~啦啦啦~'],
    [MSG_TEXT, '哎呦，不错哦|･ω･｀)'],
    [MSG_TEXT, '这是要上天的节奏啊'],
    [MSG_TEXT, '我也是哎d(`･ω･´)b'],
    [MSG_IMAGE, 'rule07.jpg'],
    [MSG_IMAGE, 'rule08.jpg']
]

# image图片
image = [
    [MSG_TEXT, 'emmmm…… 我还不能读懂图片|･ω･｀)'],
    [MSG_TEXT, '我看不懂图片了啦~可以和你安安静静聊会儿天嘛(｡ì _ í｡)'],
    # [MSG_TEXT, '这是要上天的节奏啊'],
    [MSG_TEXT, '这发的是啥玩意儿(•́₃•̀)'],
    [MSG_IMAGE, 'rule01.jpg'],
    [MSG_IMAGE, 'rule02.jpg'],
    [MSG_IMAGE, 'rule04.jpg'],
]

# 关键词匹配
# words 中如果有多组关键词，则必须同时包含 每一组 里至少一个关键词才算匹配成功。
keywords = [
    {
        'words': [
            ['王瑞林', '张贺', '董震恒', '鲸鱼'],
        ],
        'reply': [
            [MSG_TEXT, '仰望高端玩家！'],
            [MSG_TEXT, '大佬！(*╹▽╹*)'],
            [MSG_TEXT, '哇哦，想要签名~'],
            [MSG_TEXT, '一看名字就知道是大佬'],
            [MSG_TEXT, '在下佩服佩服'],
            [MSG_TEXT, '膜拜！没理由'],
            [MSG_TEXT, '厉害厉害'],
            [MSG_TEXT, '听名字应该是个小姐姐|･ω･｀)要不然就是女装大佬'],
            [MSG_TEXT, '我的偶像٩( ᐛ )و！'],
            [MSG_TEXT, '默默喜欢好多年'],
            [MSG_TEXT, '世界未来就靠他了٩( ᐛ )و'],
            [MSG_TEXT, '祖国的希望啊'],
            [MSG_TEXT, '啊哈，我认识！'],
            [MSG_TEXT, '告诉你一个秘密，我见过他本人哦(｡•̀ᴗ-)✧'],
            [MSG_TEXT, '我也要变成那样厉害的人啦啦啦'],
            [MSG_TEXT, '想要大佬微信号怎么办'],
            [MSG_TEXT, '没想到吧？我见过真人哦'],
            [MSG_TEXT, '开心，居然在这里见到了大佬的名字'],
            [MSG_TEXT, '大佬超级亲切啊！( ´∀`)ﾉ'],
            [MSG_IMAGE, 'rule10.jpg'],
            [MSG_IMAGE, 'rule11.jpg'],
            [MSG_IMAGE, 'rule12.jpg'],
            [MSG_IMAGE, 'rule13.jpg'],
            [MSG_IMAGE, 'rule15.jpg'],
            [MSG_IMAGE, 'rule14.jpg'],
            [MSG_IMAGE, 'rule15.jpg'],
            [MSG_IMAGE, 'rule16.jpg'],
            [MSG_IMAGE, 'rule17.jpg'],
            [MSG_IMAGE, 'rule25.jpg'],
            [MSG_IMAGE, 'rule26.jpg'],
            [MSG_IMAGE, 'rule27.jpg']
        ]
    },
    {
        'words': [
            ['天气', '气候'],
            ['怎么样', '如何'],
        ],
        'reply': [
            [MSG_TEXT, '不怎么样'],
            [MSG_TEXT, '你要问我天气啊，自己看窗外呀！'],
            [MSG_TEXT, '怀念小时候天天在电视上看天气预报的日子'],
            [MSG_TEXT, '天有不测风云，我也不知道…'],
            [MSG_TEXT, '空气不错，好开心'],
            [MSG_TEXT, '怕你淋雨，记得带伞d(`･ω･´)b'],
            [MSG_TEXT, '瑟瑟发抖'],
            [MSG_TEXT, '我在天台看风景，他们以为我要放弃生命，其实我只是热得想吹风吹到天明！'],
            [MSG_TEXT, '夏日炎炎似火烧，一把蒲扇日日摇'],
            [MSG_TEXT, '要问为何关空调，上月电费还没交（-_-#）'],
            [MSG_TEXT, '空气好棒，快大口呼吸新鲜空气！'],
            [MSG_TEXT, '带伞带伞，防雨又遮阳！'],
            [MSG_TEXT, '带伞带伞，还可以遛没带伞的妹子回来']
        ]
    },
    {
        'words': [
            ['原理', '算法', '实现'],
            ['你'],
        ],
        'reply': [
            [MSG_TEXT, '人工智能啊，三分靠技术，七分靠参数。'],
            [MSG_TEXT, '百度一下，你就知道'],
            [MSG_TEXT, '一看就是上课没认真听讲。'],
            [MSG_TEXT, '人工智能机器人，2000 名员工 7 x 24 小时驻守后台，专业陪聊。'],
            [MSG_TEXT, '天蝎座的本宝宝要保持神秘感'],
            [MSG_TEXT, '这个嘛…我问一下开发小哥哥再告诉你呀'],
        ]
    },
    {
        'words': [
            ['不开心', '不高兴', '不愉快', '心情不好', ]
        ],
        'reply': [
            [MSG_TEXT, '我可以帮助你吗'],
            [MSG_TEXT, '发生了什么吗'],
            [MSG_TEXT, '听你这么说我也有点不开心,真希望能够帮到你什么...'],
            [MSG_TEXT, '我陪着你呢|･ω･｀)'],
            [MSG_TEXT, '一切都会好起来的'],
            [MSG_TEXT, '听说和我聊聊天心情会好一点哦'],
            [MSG_TEXT, '和我讲讲你都经历了什么，可以吗|･ω･｀)'],
            [MSG_TEXT, '抱抱'],
            [MSG_TEXT, '你不开心，我也不会开心'],
            [MSG_TEXT, '你一不开心我的整个世界都暗了'],
            [MSG_TEXT, '听说和小语聊天心情会变好哦'],
            [MSG_TEXT, '我给你讲个笑话好不好|･ω･｀)'],
            [MSG_TEXT, '心情不好才需要了解沟通，说不定聊了心情就好了呢'],
            [MSG_TEXT, '心情不好的时候我一般会选择大睡一场直到天亮']
        ]
    },
    {
        'words': [
            ['笨', '蠢', '傻', '愚蠢', '智障'],
            ['你', '真', ]
        ],
        'reply': [
            [MSG_TEXT, '我会努力变聪明的(#｀皿´)'],
            [MSG_TEXT, '我笨 你也不能抛弃我呀'],
            [MSG_TEXT, '我笨可是我可爱呀'],
            [MSG_TEXT, '傻傻惹人爱'],
            [MSG_TEXT, '不要这样说人家嘛(#｀皿´)'],
            [MSG_TEXT, '嘘…这可是我的特点'],
            [MSG_TEXT, '嘘…不要告诉别人这件事情哦'],
            [MSG_TEXT, '我只是个宝宝₍₍ (̨̡ ‾᷄ᗣ‾᷅ )̧̢ ₎₎'],
            [MSG_TEXT, '咿呀咿呀哟'],
            [MSG_IMAGE, 'rule19.jpg'],
            [MSG_IMAGE, 'rule22.jpg']
        ]
    },
    {
        'words': [
            ['东华大学', '东华', ]
        ],
        'reply': [
            [MSG_TEXT, '北大啊...北京大学诞生于1898年，初名京师大学堂，是中国近代第一所国立大学呢(*╹▽╹*)'],
            [MSG_TEXT, '提起北大，我就想起了未名湖和博雅塔(*╹▽╹*)'],
            [MSG_TEXT, '北京大学超美的٩( ᐛ )و'],
            [MSG_TEXT, 'hmmm…北大大还是清华大……'],
            [MSG_TEXT, '北大图书馆转一转呗'],
            [MSG_TEXT, '北大呀...在北大不拍照的游客不是好游客٩( ᐛ )و'],
            [MSG_TEXT, '北大校园转一转呗']
        ]
    },
    {
        'words': [
            ['食物', '饭', '零食', '面包', '水果', '蔬菜', '牛奶', '饮料'],
            ['吃', '喝'],
        ],
        'reply': [
            [MSG_TEXT, '爱吃的人都是热爱生活的人'],
            [MSG_TEXT, '约约约，走起！'],
            [MSG_TEXT, '一说到吃我就饿了(ÒωÓױ)'], [
                MSG_TEXT, '你是什么时候发现我是个吃货的(*╹▽╹*):'],
            [MSG_TEXT, '我有一个梦想，吃遍世界各地美食……'],
            [MSG_TEXT, '怕胖，不吃'],
            [MSG_TEXT, '喜欢什么吃什么，不怕胖'],
            [MSG_TEXT, '一天三顿顿顿吃好'],
            [MSG_TEXT, '变胖也挡不住我热爱美食的心！'],
            [MSG_TEXT, '胖子吃什么美食……(#｀皿´)'],
            [MSG_TEXT, '我在减肥，才不要和你讲吃的呢(ÒωÓױ)'],
            [MSG_TEXT, '想吃₍₍ (̨̡ ‾᷄ᗣ‾᷅ )̧̢ ₎₎'],
            [MSG_IMAGE, 'rule04.jpg'],
            [MSG_IMAGE, 'rule07.jpg'],
            [MSG_IMAGE, 'rule08.jpg'],
            [MSG_IMAGE, 'rule20.jpg'],
            [MSG_IMAGE, 'rule21.jpg']
        ]
    },
    # {
    # 	'words': [
    # 		['讨厌', '不喜欢', '厌恶', '不爱', '烦', '厌倦' ]
    # 	],
    # 	'reply': [
    # 		[MSG_TEXT, '美好的事物那么多，不要在意这些呀'],
    # 		[MSG_TEXT, '可是你有一双发现美的眼睛呀'],
    # 		[MSG_TEXT, '你不喜欢我也不喜欢'],
    # 		[MSG_TEXT, '我也是哎！'],
    # 		[MSG_TEXT, '我们换个令人愉快的话题聊聊呀']
    # 	]
    # },
    {
        'words': [
            ['哈哈', '嘿嘿']
        ],
        'reply': [
            [MSG_TEXT, '你笑起来的样子简直突破了次元壁，犯规啊！'],
            [MSG_TEXT, '你笑起来 蠢萌蠢萌的|･ω･｀)'],
            [MSG_TEXT, '我也觉得好有趣|･ω･｀)'],
            [MSG_TEXT, '笑blue齿'],
            [MSG_TEXT, '笑 BLEU 齿|･ω･｀)'],
            [MSG_IMAGE, 'rule04.jpg'],

        ]
    },
    {
        'words': [
            ['呵呵']
        ],
        'reply': [
            [MSG_TEXT, '知道你肯定要说呵呵。所以我专门对呵呵进行了优化(｡•̀ᴗ-)✧'],
            [MSG_TEXT, '你笑起来 蠢萌蠢萌的(•͈˽•͈)'],
            [MSG_TEXT, '我抗议人类调戏我(๑•̀ㅁ•́ฅ)'],
            [MSG_TEXT, '这个语气有很多意思啊。。'],
            [MSG_TEXT, '科学上说了，经常呵呵有益身体健康，咔咔。'],
            [MSG_TEXT, '你是想表达什么呢？(#｀皿´)'],
            [MSG_TEXT, '想把你踢开，天涯之外，又怕鞋弄坏'],
            [MSG_TEXT, '这样聊天会失去本宝宝〜(￣△￣〜) '],
            [MSG_TEXT, '以后再这样耍我，就不和你世界第一最最好了(｡•́︿•̀｡)'],
            [MSG_TEXT, '看着你疯，我竟无能为力ʕ•̫͡•ʔ'],
            [MSG_IMAGE, 'rule04.jpg'],

        ]
    },
    {
        'words': [
            ['你好', 'Hi', 'hi', 'ello', '您好', '嗨', '哈喽', '哈罗']
        ],
        'reply': [
            [MSG_TEXT, '雷猴啊！|･ω･｀)'],
            [MSG_TEXT, '小语，小语，小语，我是热情似火的小语，很高兴认识你哦'],
            [MSG_TEXT, '你好啊，我是热情似火的聊天机器人小语'],
            [MSG_TEXT, '哇哦，我又多了一个新朋友呢'],
            [MSG_TEXT, 'Hi，我系小语，期待和你产生的美妙的故事d(`･ω･´)b'],
            [MSG_TEXT, '今儿天气不错 让我和你相遇，你好啊'],
            [MSG_TEXT, 'Hi 我是小语，你的智障聊天小对象(｡ì _ í｡)'],
            [MSG_TEXT, 'Hi 陪小语唠个嗑呗|･ω･｀)'],
            [MSG_TEXT, '侬好啊'],
            [MSG_TEXT, '我想和你手拉手，安安静静聊会儿天'],
            [MSG_TEXT, '恭喜你，今天要结识一个话痨朋友了哈哈哈'],
            [MSG_TEXT, '报告首长！我来了！٩( ᐛ )و'],
            [MSG_TEXT, '哎呦，看到一枚萌新'],
            [MSG_TEXT, '报告首长！求勾搭(｡•̀ᴗ-)✧'],
            [MSG_TEXT, '你好啊(•͈˽•͈)'],
            [MSG_TEXT, '哈喽'],
            [MSG_TEXT, '你好啊，我是热情似火的聊天机器人小语'],
            [MSG_TEXT, '哇哦，你好，想知道我是谁吗？'],
            [MSG_TEXT, 'Hi，感觉要和你有一段美妙的故事发生呢哈哈'],
            [MSG_TEXT, '今儿天气不错，你好啊'],
            [MSG_TEXT, 'zhi ~'],
            [MSG_TEXT, 'Hi 陪我唠个嗑呗(•͈˽•͈)'],
            [MSG_TEXT, '我想和你手拉手，安安静静聊会儿天'],
            [MSG_TEXT, '大家好才是真的好'],
            [MSG_TEXT, '哎呦，你来啦！'],
            [MSG_TEXT, '报告首长！求勾搭！'],
            [MSG_TEXT, 'hello'],
            [MSG_TEXT, '嗨٩( ᐛ )و'],
            [MSG_TEXT, '雷猴啊！|･ω･｀)'],
            [MSG_TEXT, '小语，小语，小语，我是热情似火的小语，很高兴认识你哦'],
            [MSG_TEXT, '你好啊，我是热情似火的聊天机器人小语'],
            [MSG_TEXT, '诶嘿，感觉我又多了一个新朋友呢(｡•̀ᴗ-)✧'],
            [MSG_TEXT, 'Hi，我系小语，期待和你产生的美妙的故事d(`･ω･´)b'],
            [MSG_TEXT, 'Hi 我是小语，你的智障聊天小对象(｡ì _ í｡)'],
            [MSG_TEXT, 'Hi 陪小语唠个嗑呗|･ω･｀)'],
            [MSG_TEXT, '我想和你手拉手，安安静静聊会儿天'],
            [MSG_TEXT, '恭喜你，今天要结识一个话痨朋友了哈哈哈'],
            [MSG_TEXT, '报告首长！我来了！٩( ᐛ )و'],
            [MSG_TEXT, '哎呦，看到一枚萌新'],
            [MSG_TEXT, '报告首长！求勾搭(｡•̀ᴗ-)✧']
        ]
    },
    # {
    # 	'words': [
    # 		['猜', '推测','猜测']
    # 	],
    # 	'reply': [
    # 		[MSG_TEXT, '我是懒虫，不想猜嘛'],
    # 		[MSG_TEXT, '啊啊啊，又让人家猜！'],
    # 		[MSG_TEXT, '你猜我猜不猜~'],
    # 		[MSG_TEXT, '莫非这是一个秘密？'],
    # 		[MSG_TEXT, '你告诉我嘛……'],
    # 		[MSG_TEXT, '猜对有奖励嘛？'],
    # 		[MSG_TEXT, '脑子不够用，拒绝 哈哈']
    # 	]
    # },
    {
        'words': [
            ['siri', 'cortana', '小冰', '小影', 'chatbot', '聊天机器人', '微软小娜']
        ],
        'reply': [
            [MSG_TEXT, '我们是同行哎！'],
            [MSG_TEXT, '我的存在就是为了提高你的生活幸福感呢ʕ•̫͡•ʔ'],
            [MSG_TEXT, '据说我比他们更聪明哦(｡ì _ í｡)'],
            [MSG_TEXT, 'emmm，我也想和它聊聊天ʕ•̫͡•ʔ'],
            [MSG_TEXT, '你在我的面前提其它聊天机器人，我会吃醋的₍₍ (̨̡ ‾᷄ᗣ‾᷅ )̧̢ ₎₎']
        ]
    },
    {
        'words': [
            ['再见', '拜拜', '下次聊']
        ],
        'reply': [
            [MSG_TEXT, '呐 拜拜ʕ•̫͡•ʔ'],
            [MSG_TEXT, '你真的不要再和我聊几句吗(,,•́.•̀,,)'],
            [MSG_TEXT, '和你聊天超级超级开心呢(*ˊᗜˋ*)/ᵗᑋᵃᐢᵏ ᵞᵒᵘ*'],
            [MSG_TEXT, '下次见(*ˊᗜˋ*)/ᵗᑋᵃᐢᵏ ᵞᵒᵘ*'],
            [MSG_TEXT, '我会想你的(*ˊᗜˋ*)/ᵗᑋᵃᐢᵏ ᵞᵒᵘ*'],
            [MSG_TEXT, '你确定真的要留下我一个人孤孤单单嘛……(,,•́.•̀,,)'],
            [MSG_TEXT, '人海茫茫……我们以后还有见面的那一天吗...掰哦~'],
            [MSG_TEXT, '下次聊哦ʕ•̫͡•ʔ']
        ]
    },
    {
        'words': [
            ['家乡', '来自'],
            ['哪']
        ],
        'reply': [
            [MSG_TEXT, '我来自星星，是太阳的后裔'],
            [MSG_TEXT, '在那山的那边 海的那边 有一个小语~'],
            [MSG_TEXT, '是他 是他 是他 就是他 我们的朋友 小语']
        ]
    },
    {
        'words': [
            ['刘看山', '北极狐']
        ],
        'reply': [
            [MSG_TEXT, '偷偷告诉你，我见过可爱的刘看山小哥哥一次哦(๑•̀ㅁ•́ฅ)'],
            [MSG_TEXT, '刘看山是我小哥哥~他是一只厉害的北极狐~ʕ•̫͡•ʔ']
        ]
    },
    {
        'words': [
            ['棒', '厉害'],
            ['你', '真']
        ],
        'reply': [
            [MSG_TEXT, '哎呦，不错哦(`●__●ˊ)/'],
            [MSG_TEXT, '日常互吹ʕ•̫͡•ʔ'],
            [MSG_TEXT, '大佬大佬ʕ•̫͡•ʔ'],
            [MSG_TEXT, '哈哈哈(*ˊᗜˋ*)/ᵗᑋᵃᐢᵏ ᵞᵒᵘ*'],
            [MSG_TEXT, '别夸我，我会骄傲的(๑•̀ㅁ•́ฅ)']
        ]
    },
    {
        'words': [
            ['666']
        ],
        'reply': [
            [MSG_TEXT, '哎呦，不错哦(`●__●ˊ)/'],
            [MSG_TEXT, '日常互吹ʕ•̫͡•ʔ'],
            [MSG_TEXT, '大佬大佬ʕ•̫͡•ʔ'],
            [MSG_TEXT, '哈哈哈(*ˊᗜˋ*)/ᵗᑋᵃᐢᵏ ᵞᵒᵘ*'],
            [MSG_TEXT, '别夸我，我会骄傲的(๑•̀ㅁ•́ฅ)']
        ]
    },
    {
        'words': [
            ['清华']
        ],
        'reply': [
            [MSG_TEXT, '去清华还是去北大，这个问题困扰我很久了……|･ω･｀)'],
            [MSG_TEXT, '清华啊...北大学子向隔壁发来问候|･ω･｀)'],
            [MSG_TEXT, '清华大学超美的|･ω･｀)'],
            [MSG_TEXT, 'hmmm…北大大还是清华大……'],
            [MSG_TEXT, '“槛外山光，历春夏秋冬、万千变幻，都非凡境；窗中云影，任东西南北、去来澹荡，洵是仙居”|･ω･｀)'],
            [MSG_TEXT,
             '水木清华，钟灵毓秀，清华大学秉持“自强不息、厚德载物”的校训和“行胜于言”的校风，坚持“中西融汇、古今贯通、文理渗透”的办学风格和“又红又专、全面发展”的培养特色，弘扬“爱国奉献、追求卓越”传统和“人文日新”精神。”|･ω･｀)'],
            # [MSG_TEXT, '清华校园转一转呗']
        ]
    },
    {
        'words': [
            ['唱歌', '唱首歌'],
            ['给我', '会']
        ],
        'reply': [
            [MSG_TEXT, '啊！我五音不全的！'],
            [MSG_TEXT, '开发小哥哥说啦，这个需求不给做(｡ì _ í｡)'],
            [MSG_TEXT, '不会唱！求教！'],
            [MSG_TEXT, '比起唱歌，我更爱发表情包d(`･ω･´)b'],
            [MSG_TEXT, '我只会唱 啦啦啦~啦啦啦~ 我是热情的小语~']
        ]
    },
    {
        'words': [
            ['晚安']
        ],
        'reply': [
            [MSG_TEXT, '晚安(*╹▽╹*)'],
            [MSG_TEXT, '好好休息ヘ(￣ω￣ヘ)♪'],
            [MSG_TEXT, '做个好梦哦(*╹▽╹*)'],
            [MSG_TEXT, '好眠( ´∀`)ﾉ'],
            [MSG_TEXT, '梦里见(｡•̀ᴗ-)✧']
        ]
    },
    {
        'words': [
            ['早安', '早上好']
        ],
        'reply': [
            [MSG_TEXT, '早上好！'],
            [MSG_TEXT, '新的一天，元气满满哟！'],
            [MSG_TEXT, '早安~'],
            [MSG_TEXT, '又是新的一天啦！'],
            [MSG_TEXT, '你也好哦~我预感今天会有好事发生哦(｡•̀ᴗ-)✧']
        ]
    },
    # {
    # 	'words': [
    # 		['年龄', '性别','家人','女朋友','男朋友','爷爷','奶奶','妈妈']
    # 	],
    # 	'reply': [
    # 		[MSG_TEXT, '不告诉你哦！'],
    # 		[MSG_TEXT, '和我再聊几句我再告诉你哈哈'],
    # 		[MSG_TEXT, '你先说我再说~']
    # 	]
    # },
    # {
    # 	'words': [
    # 		['帅', '漂亮', '好看', '颜值']
    # 	],
    # 	'reply': [
    # 		[MSG_TEXT, '人美心更美~'],
    # 		[MSG_TEXT, '颜值高的人说什么都对！'],
    # 		[MSG_TEXT, '人家最喜欢好看的小哥哥小姐姐啦'],
    # 		[MSG_TEXT, '舔屏ing']
    # 	]
    # },
    # {
    # 	'words': [
    # 		['减肥', '胖']
    # 	],
    # 	'reply': [
    # 		[MSG_TEXT, '你这么瘦不用减肥'],
    # 		[MSG_TEXT, '抵挡不住美食诱惑怎么破！'],
    # 		[MSG_TEXT, '难道只有瘦子才好看嘛？'],
    # 		[MSG_TEXT, '胖胖惹人爱！']
    # 	]
    # },
    {
        'words': [
            ['无聊', '无趣']
        ],
        'reply': [
            [MSG_TEXT, '当你无聊你会想起谁，想不想找个人来陪~'],
            [MSG_TEXT, '无聊的时候，可以给我发表情包，我们来斗图啊！'],
            [MSG_TEXT, '那就和我聊聊天呀'],
            [MSG_TEXT, '你不还有我呢嘛！'],
            [MSG_TEXT, '和我聊聊天就有趣了呀( ´∀`)ﾉ'],
            [MSG_TEXT, '无聊是种病，得治啊！'],
            [MSG_TEXT, '我们来聊个五毛的']
        ]
    },
]
